src/ExchangePlans/ОбменПартКом83_Сайт_остатки_на_складах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменПартКом83_Сайт_остатки_на_складах</Name>
			<Comment>обмен изменившимися остатками</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/InformationRegisters/ОстаткиНоменклатурыДляПланаОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиНоменклатурыДляПланаОбменаССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвободныйОстатокКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяПартияКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДтВрм_Расчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДтВрм_Посылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДтВрм_Подтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ReceivedNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоллары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕвро</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиВДокументе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обновил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Comment>Удалить - реквизит НоменклатурыКонтрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИдентификаторыСтрокПриходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрокПриходов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приход</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерестикеровкаПереоценка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковПоРегиструТоварыНаСкладах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартии77</Name>
					<Comment>для проверки загруженных из 1с7 партий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ExchangePlans/ОбменПартКом83_Сайт_остатки_на_складах/Ext/ManagerModule.bsl
Функция ПолучитьМетаданные()
	Возврат Метаданные.ПланыОбмена.ОбменПартКом83_Сайт_остатки_на_складах;
КонецФункции

Функция URIПространстваИмен() 
	//Возврат "http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema";	
	Возврат ПланыОбмена.ОбменПартКом83_Сайт.URIПространстваИмен();
КонецФункции

Функция ВыгрузитьСообщениеОбмена_ОстаткиНоменклатуры(вхИдентификаторУзлаОбмена, вхНомерПринятого) Экспорт
	
	лОтправитель = ЭтотУзел();
	лИсходящий = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(ПолучитьМетаданные(), вхИдентификаторУзлаОбмена);
	Если НЕ ЗначениеЗаполнено(лИсходящий) тогда
		ВызватьИсключение "[ВыгрузитьСообщениеОбмена]: неправильный параметр номер 1.";	
	КонецЕсли;
	
	// фиксируем номер принятого
	Если НЕ лИсходящий.НомерПринятого = вхНомерПринятого Тогда
		
		//ПланыОбмена.УдалитьРегистрациюИзменений(лИсходящий, вхНомерПринятого);
		
		Попытка
			ОбъектУзла = лИсходящий.ПолучитьОбъект();
			ОбъектУзла.НомерПринятого = вхНомерПринятого;
			ОбъектУзла.Записать();
			
			ДтВрмПодтверждения = ТекущаяДата();
			
			НаборЗаписи  = РегистрыСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом.СоздатьНаборЗаписей();
			НаборЗаписи.Отбор.ReceivedNo.Установить(вхНомерПринятого);
			НаборЗаписи.Прочитать();
			Для каждого Запись Из НаборЗаписи Цикл
				Запись.Подтвержден = Истина;
				Запись.ДтВрм_Подтверждения = ДтВрмПодтверждения;	
			КонецЦикла;		
			НаборЗаписи.Записать();
			
		Исключение
			ВызватьИсключение "Возникла ошибка при изменении номеров сообщений обмена: ";
		Конецпопытки;
	КонецЕсли;
	
	
	
	лТипОбъектаXDTO = ФабрикаXDTO.Тип(URIПространстваИмен(), "РегистрыНакопления.ТоварныеОстатки");
	лТипОбъекты = ФабрикаXDTO.Тип(URIПространстваИмен(), "Объекты");
	лТипСообщениеОбмена = ФабрикаXDTO.Тип(URIПространстваИмен(), "СообщениеОбмена");
	
	лПустышка = Новый ЗаписьXML;
	лПустышка.УстановитьСтроку("utf-8");
	лЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	лЗаписьСообщения.НачатьЗапись(лПустышка, лИсходящий);
	лНомерСообщения = лЗаписьСообщения.НомерСообщения;
	
	Попытка
		
		// сформируем посылку
		лСообщениеОбмена = ФабрикаXDTO.Создать(лТипСообщениеОбмена);
		лСообщениеОбмена.ПланОбмена = "ОбменПартКом83_Сайт_остатки_на_складах";
		лСообщениеОбмена.Отправитель = лОтправитель.ИдентификаторУзла;
		лСообщениеОбмена.Получатель = вхИдентификаторУзлаОбмена;
		лСообщениеОбмена.НомерСообщения = лНомерСообщения;
		лСообщениеОбмена.НомерПринятого = вхНомерПринятого;
		
		лОбъекты = ФабрикаXDTO.Создать(лТипОбъекты);
		лСписокОбъектов = лОбъекты.ПолучитьСписок("Объект");
		
		// передадим справочные данные, зарегистрированные к обмену
		////////////лВыгружаемыеОбъекты = ОбменДаннымиКлиентСервер.ВыбратьПакетИзмененийДляУзлаОбмена(лИсходящий, лСообщениеОбмена.НомерСообщения, 1000);
		////////////Для Каждого лЭлементСоответствия Из лВыгружаемыеОбъекты цикл
		////////////	лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лЭлементСоответствия.Ключ);
		////////////	лВыгруженныеОбъекты = лМенеджерОбъекта.ВыгрузитьЭлементы(лЭлементСоответствия.Значение, ПолучитьМетаданные());
		////////////	Для Каждого лВыгруженныйОбъект Из лВыгруженныеОбъекты цикл
		////////////		лСписокОбъектов.Добавить(лВыгруженныйОбъект);
		////////////	КонецЦикла;
		////////////КонецЦикла;
		
		// передадим расчетные данные, в данном случае это изменения по товарным остаткам, включая VMI
		ДтВрм = ТекущаяДата();
		РезультатАнализа = РассчитатьПакетИзмененийДляУзлаОбмена_ТоварныеОстатки(вхНомерПринятого, ДтВрм);
		КоличествоПакетов = РезультатАнализа.Количество();
		ТаблицаОстатков = РезультатАнализа[КоличествоПакетов - 2].Выгрузить();
		ТаблицаЗаписейНаУдаление = РезультатАнализа[КоличествоПакетов - 1].Выгрузить();
		///////////ТаблицаОшибокVMI = РезультатАнализа[КоличествоПакетов - 1].Выгрузить();
		
		Если ТаблицаОстатков.Количество() > 0 тогда
			
			НаборЗаписи  = РегистрыСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом.СоздатьНаборЗаписей();
			НаборЗаписи.Отбор.ReceivedNo.Установить(лНомерСообщения);
			НаборЗаписи.Прочитать();
			НаборЗаписи.Очистить(); 
			
			Для Каждого лЭлементСоответствия Из ТаблицаОстатков цикл
				лНоменклатура = лЭлементСоответствия.Номенклатура;
				лПрайс = лЭлементСоответствия.ПрайсПоставщика;
				
				// уложим результат запроса согласно структуре пакета
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				лОбъект.Номенклатура = лНоменклатура.УникальныйИдентификатор();
				лОбъект.ПрайсПоставщика = лПрайс.УникальныйИдентификатор();
				//PaSe - отрицательные остатки сайт некорректно воспринимает//
				лОбъект.СвободныйОстатокКоличество = ?(лЭлементСоответствия.СвободныйОстатокКоличество > 0, лЭлементСоответствия.СвободныйОстатокКоличество, 0);
				лОбъект.МинимальнаяПартияКоличество = 1;
				лОбъект.Цена = лЭлементСоответствия.Цена;
				
				лСписокОбъектов.Добавить(лОбъект);
				
				// запомним содержимое посылки
				Наб = НаборЗаписи.Добавить();
				Наб.ReceivedNo = лНомерСообщения;
				Наб.Номенклатура = лНоменклатура;
				Наб.ПрайсПоставщика = лПрайс;
				Наб.СвободныйОстатокКоличество = лЭлементСоответствия.СвободныйОстатокКоличество;
				Наб.МинимальнаяПартияКоличество = 1;
				Наб.Цена = лЭлементСоответствия.Цена;
				Наб.ДтВрм_Расчета = ДтВрм;
				Наб.ДтВрм_Посылки = ТекущаяДата();
				
			КонецЦикла;
			
			НаборЗаписи.Записать();
		КонецЕсли;
		
		// очистим историю по содержимому предыдущих посылок
		Если ТаблицаЗаписейНаУдаление.Количество() > 0 тогда
			Рег = РегистрыСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом;
			НЗ = Рег.СоздатьНаборЗаписей();
			Для каждого стрт из ТаблицаЗаписейНаУдаление цикл
				НЗ.Отбор.ReceivedNo.Установить(стрт.ReceivedNo);
				НЗ.Отбор.Номенклатура.Установить(стрт.Номенклатура);
				НЗ.Отбор.ПрайсПоставщика.Установить(стрт.ПрайсПоставщика);
				НЗ.Очистить();
				НЗ.Записать();
			КонецЦикла;
		КонецЕсли;
		
		
		////////Если ТаблицаОшибокVMI.Количество() > 0 тогда
		////////	ТекстОшибокVMI = "";
		////////	
		////////	cxcxcxcx = 0;
		////////	Для каждого стро из ТаблицаОшибокVMI цикл
		////////		cxcxcxcx = cxcxcxcx + 1;
		////////		
		////////		ТекстОшибокVMI = ТекстОшибокVMI + Символы.ПС  
		////////		+ СокрлП(cxcxcxcx)
		////////		//+ ". Описание: " + стро.ДляОтправкиПоEmail
		////////		+ ", ТТ: [" + СокрЛП(стро.ТорговаяТочка.Код) + "]" + СокрЛП(стро.ТорговаяТочка.Наименование) + Символы.ПС
		////////		+ ", Склад: ["  + СокрЛП(стро.Склад.Код) + "]" + СокрЛП(стро.Склад.Наименование) + Символы.ПС
		////////		+ ", Номенклатура: ["  + СокрЛП(стро.Номенклатура.Код) + "]" + СокрЛП(стро.Номенклатура.Наименование)  + Символы.ПС
		////////		+ ", Количество: [" + СокрЛП(стро.КоличествоОстаток) + "]" + Символы.ПС
		////////		;
		////////	КонецЦикла;
		////////	
		////////	Если НЕ ПустаяСтрока(ТекстОшибокVMI) Тогда
		////////		ТекстОшибокУИД = "Описание: при выгрузке данных по товарным остаткам на сайт Не найдена запись в спр.Прайсы Поставщиков."  
		////////					   + Символы.ПС 
		////////					   + Символы.ПС 
		////////					   + ТекстОшибокУИД;
		////////		РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаVMI,ТекстОшибокVMI, "Ошибки VMI");
		////////	КонецЕсли;
		////////КонецЕсли;
		
		// все объекты добавлены, заканчиваем формировать сообщение
		лСообщениеОбмена.Объекты = лОбъекты;
		лЗаписьСообщения.ЗакончитьЗапись();
		
	Исключение
		лЗаписьСообщения.ПрерватьЗапись();
		ВызватьИсключение ;
	КонецПопытки;
	
	// уложим данные в хml
	Тест = Ложь;
	лЗаписьХМЛ = Новый ЗаписьXML;
	Если Тест тогда
		Файл = ПолучитьИмяВременногоФайла("xml"); 
		лЗаписьХМЛ.ОткрытьФайл(Файл);
		ФабрикаXDTO.ЗаписатьXML(лЗаписьХМЛ, лСообщениеОбмена, "ost");
		Сообщить(Файл);
	Иначе
		лЗаписьХМЛ.УстановитьСтроку("utf-8");
		лЗаписьХМЛ.ЗаписатьОбъявлениеXML();
		ФабрикаXDTO.ЗаписатьXML(лЗаписьХМЛ, лСообщениеОбмена);
	КонецЕсли;
	
	Возврат лЗаписьХМЛ.Закрыть();	
КонецФункции

Функция РассчитатьПакетИзмененийДляУзлаОбмена_ТоварныеОстатки(лНомерПринятого, ДтВрм) Экспорт
	
	лКлючАлгоритма = "ПланОбмена_ОбменПартКом83_Сайт_остатки_на_складах_РассчитатьПакетИзмененийДляУзлаОбмена_ТоварныеОстатки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	///////////////////////////////////////////
	
	Запрос = Новый Запрос;
	//Семенов И.П. 14.05.2019 XX-2457(
	Если ЭтоАктивнаяЗадачаJirа(Справочники.ЗадачиJira.XX2457) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура КАК Номенклатура,
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика КАК ПрайсПоставщика,
		               |	МАКСИМУМ(ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo) КАК ReceivedNo
		               |ПОМЕСТИТЬ СрезПоследнихПоНомеруПосылки
		               |ИЗ
		               |	РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
		               |ГДЕ
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.Подтвержден = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура,
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ReceivedNo,
		               |	Номенклатура,
		               |	ПрайсПоставщика
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СрезПоследнихПоНомеруПосылки.Номенклатура,
		               |	СрезПоследнихПоНомеруПосылки.ПрайсПоставщика,
		               |	СрезПоследнихПоНомеруПосылки.ReceivedNo,
		               |	ЕСТЬNULL(ОстаткиНоменклатурыДляПланаОбменаССайтом.СвободныйОстатокКоличество, 0) КАК СвободныйОстатокКоличество,
		               |	ЕСТЬNULL(ОстаткиНоменклатурыДляПланаОбменаССайтом.Цена, 0) КАК Цена
		               |ПОМЕСТИТЬ ДанныеСайта
		               |ИЗ
		               |	СрезПоследнихПоНомеруПосылки КАК СрезПоследнихПоНомеруПосылки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
		               |		ПО СрезПоследнихПоНомеруПосылки.ReceivedNo = ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo
		               |			И СрезПоследнихПоНомеруПосылки.Номенклатура = ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура
		               |			И СрезПоследнихПоНомеруПосылки.ПрайсПоставщика = ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	СрезПоследнихПоНомеруПосылки.ПрайсПоставщика,
		               |	СрезПоследнихПоНомеруПосылки.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПрайсыПоставщиков.Ссылка,
		               |	ПрайсыПоставщиков.Владелец,
		               |	ПрайсыПоставщиков.Склад,
		               |	ПрайсыПоставщиков.Склад.СкладVMI КАК СкладVMI,
		               |	ВЫРАЗИТЬ(ПрайсыПоставщиков.Владелец КАК Справочник.ТорговыеТочки).Владелец КАК Контрагент
		               |ПОМЕСТИТЬ Прайсы
		               |ИЗ
		               |	Справочник.ПрайсыПоставщиков КАК ПрайсыПоставщиков
		               |ГДЕ
		               |	НЕ ПрайсыПоставщиков.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		               |	И ПрайсыПоставщиков.Склад.ВыгружатьНаСайт = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Прайсы.Склад
		               |ПОМЕСТИТЬ Склады
		               |ИЗ
		               |	Прайсы КАК Прайсы
		               |ГДЕ
		               |	Прайсы.СкладVMI = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Прайсы.Склад
		               |ПОМЕСТИТЬ СкладыVMI
		               |ИЗ
		               |	Прайсы КАК Прайсы
		               |ГДЕ
		               |	Прайсы.СкладVMI = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПартииТоваровОстатки.Номенклатура,
		               |	ПартииТоваровОстатки.Склад,
		               |	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ТоварныеОстаткиСвои
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваров.Остатки(
		               |			&ДтВрм,
		               |			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |				И Склад В
		               |					(ВЫБРАТЬ
		               |						Склады.Склад
		               |					ИЗ
		               |						Склады)) КАК ПартииТоваровОстатки
		               |ГДЕ
		               |	ПартииТоваровОстатки.КоличествоОстаток > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПартииТоваровОстатки.Номенклатура,
		               |	ПартииТоваровОстатки.Склад,
		               |	ЕСТЬNULL(ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Поставщик,
		               |	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ТоварныеОстаткиVMIИсходные
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваров.Остатки(
		               |			&ДтВрм,
		               |			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |				И Склад В
		               |					(ВЫБРАТЬ
		               |						СкладыVMI.Склад
		               |					ИЗ
		               |						СкладыVMI)) КАК ПартииТоваровОстатки
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ПартииТоваровОстатки.Номенклатура,
		               |	ПартииТоваровОстатки.Склад,
		               |	ЕСТЬNULL(ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварныеОстаткиVMIИсходные.Номенклатура КАК Номенклатура,
		               |	ТоварныеОстаткиVMIИсходные.Склад КАК Склад,
		               |	МАКСИМУМ(ТоварныеОстаткиVMIИсходные.Поставщик) КАК Поставщик
		               |ПОМЕСТИТЬ ТоварыVMIПоставщикПоумолчанию
		               |ИЗ
		               |	ТоварныеОстаткиVMIИсходные КАК ТоварныеОстаткиVMIИсходные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварныеОстаткиVMIИсходные.Номенклатура,
		               |	ТоварныеОстаткиVMIИсходные.Склад
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварныеОстаткиVMIИсходные.Номенклатура КАК Номенклатура,
		               |	ТоварныеОстаткиVMIИсходные.Склад КАК Склад,
		               |	ВЫБОР
		               |		КОГДА ТоварныеОстаткиVMIИсходные.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ТоварыVMIПоставщикПоумолчанию.Поставщик
		               |		ИНАЧЕ ТоварныеОстаткиVMIИсходные.Поставщик
		               |	КОНЕЦ КАК Поставщик,
		               |	СУММА(ТоварныеОстаткиVMIИсходные.КоличествоОстаток) КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ТоварныеОстаткиVMI
		               |ИЗ
		               |	ТоварныеОстаткиVMIИсходные КАК ТоварныеОстаткиVMIИсходные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыVMIПоставщикПоумолчанию КАК ТоварыVMIПоставщикПоумолчанию
		               |		ПО ТоварныеОстаткиVMIИсходные.Номенклатура = ТоварыVMIПоставщикПоумолчанию.Номенклатура
		               |			И ТоварныеОстаткиVMIИсходные.Склад = ТоварыVMIПоставщикПоумолчанию.Склад
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварныеОстаткиVMIИсходные.Номенклатура,
		               |	ТоварныеОстаткиVMIИсходные.Склад,
		               |	ВЫБОР
		               |		КОГДА ТоварныеОстаткиVMIИсходные.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ТоварыVMIПоставщикПоумолчанию.Поставщик
		               |		ИНАЧЕ ТоварныеОстаткиVMIИсходные.Поставщик
		               |	КОНЕЦ
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(ТоварныеОстаткиVMIИсходные.КоличествоОстаток) > 0
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Склад,
		               |	Поставщик
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Номенклатура,
		               |	РезервыТоваровОстатки.Склад,
		               |	РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ РезервыCвои
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			&ДтВрм,
		               |			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |				И Склад В
		               |					(ВЫБРАТЬ
		               |						Склады.Склад
		               |					ИЗ
		               |						Склады)) КАК РезервыТоваровОстатки
		               |ГДЕ
		               |	РезервыТоваровОстатки.КоличествоОстаток > 0
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Номенклатура,
		               |	РезервыТоваровОстатки.Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Номенклатура,
		               |	РезервыТоваровОстатки.Склад,
		               |	ЕСТЬNULL(РезервыТоваровОстатки.СтрокаЗаявки.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Поставщик,
		               |	РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ РезервыVMIИсходные
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			&ДтВрм,
		               |			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |				И Склад В
		               |					(ВЫБРАТЬ
		               |						СкладыVMI.Склад
		               |					ИЗ
		               |						СкладыVMI)) КАК РезервыТоваровОстатки
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Номенклатура,
		               |	РезервыТоваровОстатки.Склад,
		               |	ЕСТЬNULL(РезервыТоваровОстатки.СтрокаЗаявки.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РезервыVMIИсходные.Номенклатура КАК Номенклатура,
		               |	РезервыVMIИсходные.Склад КАК Склад,
		               |	ВЫБОР
		               |		КОГДА РезервыVMIИсходные.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ТоварыVMIПоставщикПоумолчанию.Поставщик
		               |		ИНАЧЕ РезервыVMIИсходные.Поставщик
		               |	КОНЕЦ КАК Поставщик,
		               |	СУММА(РезервыVMIИсходные.КоличествоОстаток) КАК КоличествоОстаток
		               |ПОМЕСТИТЬ РезервыVMI
		               |ИЗ
		               |	РезервыVMIИсходные КАК РезервыVMIИсходные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыVMIПоставщикПоумолчанию КАК ТоварыVMIПоставщикПоумолчанию
		               |		ПО РезервыVMIИсходные.Номенклатура = ТоварыVMIПоставщикПоумолчанию.Номенклатура
		               |			И РезервыVMIИсходные.Склад = ТоварыVMIПоставщикПоумолчанию.Склад
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РезервыVMIИсходные.Номенклатура,
		               |	РезервыVMIИсходные.Склад,
		               |	ВЫБОР
		               |		КОГДА РезервыVMIИсходные.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ТоварыVMIПоставщикПоумолчанию.Поставщик
		               |		ИНАЧЕ РезервыVMIИсходные.Поставщик
		               |	КОНЕЦ
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(РезервыVMIИсходные.КоличествоОстаток) > 0
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Склад,
		               |	Поставщик
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварныеОстаткиСвои.Номенклатура,
		               |	ТоварныеОстаткиСвои.Склад,
		               |	ТоварныеОстаткиСвои.КоличествоОстаток - ЕСТЬNULL(РезервыCвои.КоличествоОстаток, 0) КАК КоличествоОстаток
		               |ПОМЕСТИТЬ СвойТовар
		               |ИЗ
		               |	ТоварныеОстаткиСвои КАК ТоварныеОстаткиСвои
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РезервыCвои КАК РезервыCвои
		               |		ПО ТоварныеОстаткиСвои.Склад = РезервыCвои.Склад
		               |			И ТоварныеОстаткиСвои.Номенклатура = РезервыCвои.Номенклатура
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ТоварныеОстаткиСвои.Номенклатура,
		               |	ТоварныеОстаткиСвои.Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СвободныйОстаток.Номенклатура,
		               |	СвободныйОстаток.Склад,
		               |	СвободныйОстаток.Поставщик,
		               |	СвободныйОстаток.КоличествоОстаток - ЕСТЬNULL(РезервыVMI.КоличествоОстаток, 0) КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ТоварVMI
		               |ИЗ
		               |	ТоварныеОстаткиVMI КАК СвободныйОстаток
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РезервыVMI КАК РезервыVMI
		               |		ПО СвободныйОстаток.Склад = РезервыVMI.Склад
		               |			И СвободныйОстаток.Номенклатура = РезервыVMI.Номенклатура
		               |			И СвободныйОстаток.Поставщик = РезервыVMI.Поставщик
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	СвободныйОстаток.Номенклатура,
		               |	СвободныйОстаток.Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
		               |ПОМЕСТИТЬ Цены
		               |ИЗ
		               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		               |			&ДтВрм,
		               |			Номенклатура В
		               |					(ВЫБРАТЬ
		               |						СвойТовар.Номенклатура
		               |					ИЗ
		               |						СвойТовар)
		               |				И ТипЦен = &ТипЦенДляСайта) КАК ЦеныНоменклатурыСрезПоследних
		               |ГДЕ
		               |	ЦеныНоменклатурыСрезПоследних.Цена > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЦеныНоменклатурыСрезПоследних.Номенклатура
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ЦеныНоменклатурыСрезПоследних.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВложенныйЗапрос.Поставщик
		               |ПОМЕСТИТЬ ПоставщикиVMI
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ТоварVMI.Поставщик КАК Поставщик
		               |	ИЗ
		               |		ТоварVMI КАК ТоварVMI
		               |	ГДЕ
		               |		ТоварVMI.Поставщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Прайсы.Контрагент
		               |	ИЗ
		               |		Прайсы КАК Прайсы
		               |	ГДЕ
		               |		Прайсы.Владелец ССЫЛКА Справочник.ТорговыеТочки) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Поставщик
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура КАК Номенклатура,
		               |	МАКСИМУМ(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена) КАК Цена,
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Владелец
		               |ПОМЕСТИТЬ ЦеныКА
		               |ИЗ
		               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		               |			&ДтВрм,
		               |			Номенклатура.Номенклатура В
		               |					(ВЫБРАТЬ
		               |						ТоварVMI.Номенклатура
		               |					ИЗ
		               |						ТоварVMI)
		               |				И Номенклатура.Владелец В
		               |					(ВЫБРАТЬ
		               |						ПоставщикиVMI.Поставщик
		               |					ИЗ
		               |						ПоставщикиVMI)) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		               |ГДЕ
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура,
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Владелец
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(Прайсы.Ссылка) КАК Ссылка,
		               |	Прайсы.Склад КАК Склад
		               |ПОМЕСТИТЬ ПрайсыСкладов
		               |ИЗ
		               |	Прайсы КАК Прайсы
		               |ГДЕ
		               |	Прайсы.СкладVMI = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Прайсы.Склад
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВложенныйЗапрос.ПрайсПоставщика,
		               |	ВложенныйЗапрос.Номенклатура,
		               |	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
		               |	МАКСИМУМ(ВложенныйЗапрос.Цена) КАК Цена
		               |ПОМЕСТИТЬ ОстаткиСгруппированные
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		СвойТовар.Номенклатура КАК Номенклатура,
		               |		СвойТовар.Склад КАК Склад,
		               |		СвойТовар.КоличествоОстаток КАК КоличествоОстаток,
		               |		ПрайсыСкладов.Ссылка КАК ПрайсПоставщика,
		               |		ЕСТЬNULL(Цены.Цена, 0) КАК Цена
		               |	ИЗ
		               |		СвойТовар КАК СвойТовар
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ПрайсыСкладов КАК ПрайсыСкладов
		               |			ПО СвойТовар.Склад = ПрайсыСкладов.Склад
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
		               |			ПО СвойТовар.Номенклатура = Цены.Номенклатура
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ТоварVMI.Номенклатура,
		               |		ТоварVMI.Склад,
		               |		ТоварVMI.КоличествоОстаток,
		               |		Прайсы.Ссылка,
		               |		ЕСТЬNULL(ЦеныКА.Цена, 0)
		               |	ИЗ
		               |		ТоварVMI КАК ТоварVMI
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Прайсы КАК Прайсы
		               |			ПО ТоварVMI.Склад = Прайсы.Склад
		               |				И ТоварVMI.Поставщик = Прайсы.Контрагент
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ЦеныКА КАК ЦеныКА
		               |			ПО ТоварVMI.Номенклатура = ЦеныКА.Номенклатура
		               |				И ТоварVMI.Поставщик = ЦеныКА.НоменклатураВладелец) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Номенклатура,
		               |	ВложенныйЗапрос.ПрайсПоставщика
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ВложенныйЗапрос.ПрайсПоставщика,
		               |	ВложенныйЗапрос.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВсеОстатки.ПрайсПоставщика, Сайт.ПрайсПоставщика) КАК ПрайсПоставщика,
		               |	ЕСТЬNULL(ВсеОстатки.Номенклатура, Сайт.Номенклатура) КАК Номенклатура,
		               |	ЕСТЬNULL(ВсеОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокКоличество,
		               |	ЕСТЬNULL(ВсеОстатки.Цена, 0) КАК Цена,
		               |	1 КАК Сч
		               |ИЗ
		               |	ОстаткиСгруппированные КАК ВсеОстатки
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеСайта КАК Сайт
		               |		ПО ВсеОстатки.ПрайсПоставщика = Сайт.ПрайсПоставщика
		               |			И ВсеОстатки.Номенклатура = Сайт.Номенклатура
		               |ГДЕ
		               |	(НЕ ЕСТЬNULL(ВсеОстатки.КоличествоОстаток, 0) = ЕСТЬNULL(Сайт.СвободныйОстатокКоличество, 0)
		               |			ИЛИ НЕ ЕСТЬNULL(ВсеОстатки.Цена, 0) = ЕСТЬNULL(Сайт.Цена, 0))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo,
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура,
		               |	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
		               |ИЗ
		               |	РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СрезПоследнихПоНомеруПосылки КАК СрезПоследнихПоНомеруПосылки
		               |		ПО ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo = СрезПоследнихПоНомеруПосылки.ReceivedNo
		               |			И ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура = СрезПоследнихПоНомеруПосылки.Номенклатура
		               |			И ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика = СрезПоследнихПоНомеруПосылки.ПрайсПоставщика
		               |ГДЕ
		               |	(СрезПоследнихПоНомеруПосылки.ReceivedNo ЕСТЬ NULL
		               |			ИЛИ СрезПоследнихПоНомеруПосылки.Номенклатура ЕСТЬ NULL
		               |			ИЛИ СрезПоследнихПоНомеруПосылки.ПрайсПоставщика ЕСТЬ NULL)";
	Иначе 
	//)Семенов И.П.
		Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура,
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика,
						|	МАКСИМУМ(ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo) КАК ReceivedNo
						|ПОМЕСТИТЬ СрезПоследнихПоНомеруПосылки
						|ИЗ
						|	РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
						|ГДЕ
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.Подтвержден = ИСТИНА
						|
						|СГРУППИРОВАТЬ ПО
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура,
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СрезПоследнихПоНомеруПосылки.Номенклатура,
						|	СрезПоследнихПоНомеруПосылки.ПрайсПоставщика,
						|	СрезПоследнихПоНомеруПосылки.ReceivedNo,
						|	ЕСТЬNULL(ОстаткиНоменклатурыДляПланаОбменаССайтом.СвободныйОстатокКоличество, 0) КАК СвободныйОстатокКоличество,
						|	ЕСТЬNULL(ОстаткиНоменклатурыДляПланаОбменаССайтом.Цена, 0) КАК Цена
						|ПОМЕСТИТЬ ДанныеСайта
						|ИЗ
						|	СрезПоследнихПоНомеруПосылки КАК СрезПоследнихПоНомеруПосылки
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
						|		ПО СрезПоследнихПоНомеруПосылки.ReceivedNo = ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo
						|			И СрезПоследнихПоНомеруПосылки.Номенклатура = ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура
						|			И СрезПоследнихПоНомеруПосылки.ПрайсПоставщика = ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	СрезПоследнихПоНомеруПосылки.ПрайсПоставщика,
						|	СрезПоследнихПоНомеруПосылки.Номенклатура
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo,
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура,
						|	ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика
						|ПОМЕСТИТЬ НаборЗаписейНаУдалениеВИсторииПосылок
						|ИЗ
						|	РегистрСведений.ОстаткиНоменклатурыДляПланаОбменаССайтом КАК ОстаткиНоменклатурыДляПланаОбменаССайтом
						|		ЛЕВОЕ СОЕДИНЕНИЕ СрезПоследнихПоНомеруПосылки КАК СрезПоследнихПоНомеруПосылки
						|		ПО ОстаткиНоменклатурыДляПланаОбменаССайтом.ReceivedNo = СрезПоследнихПоНомеруПосылки.ReceivedNo
						|			И ОстаткиНоменклатурыДляПланаОбменаССайтом.Номенклатура = СрезПоследнихПоНомеруПосылки.Номенклатура
						|			И ОстаткиНоменклатурыДляПланаОбменаССайтом.ПрайсПоставщика = СрезПоследнихПоНомеруПосылки.ПрайсПоставщика
						|ГДЕ
						|	(СрезПоследнихПоНомеруПосылки.ReceivedNo ЕСТЬ NULL
						|			ИЛИ СрезПоследнихПоНомеруПосылки.Номенклатура ЕСТЬ NULL
						|			ИЛИ СрезПоследнихПоНомеруПосылки.ПрайсПоставщика ЕСТЬ NULL)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПрайсыПоставщиков.Ссылка,
						|	ПрайсыПоставщиков.Владелец,
						|	ПрайсыПоставщиков.Склад
						|ПОМЕСТИТЬ Прайсы
						|ИЗ
						|	Справочник.ПрайсыПоставщиков КАК ПрайсыПоставщиков
						|ГДЕ
						|	НЕ ПрайсыПоставщиков.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
						|	И ПрайсыПоставщиков.Склад.ВыгружатьНаСайт = ИСТИНА
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПартииТоваровОстатки.Номенклатура,
						|	ПартииТоваровОстатки.Склад,
						|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
						|ПОМЕСТИТЬ ТоварныеОстаткиСвои
						|ИЗ
						|	РегистрНакопления.ПартииТоваров.Остатки(
						|			&ДтВрм,
						|			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						|				И Склад В
						|					(ВЫБРАТЬ
						|						Прайсы.Склад
						|					ИЗ
						|						Прайсы
						|					ГДЕ
						|						НЕ Прайсы.Склад.СкладVMI)
						|				И НЕ СтрокаПрихода = ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрокПриходов.ПустаяСсылка)) КАК ПартииТоваровОстатки
						|ГДЕ
						|	ПартииТоваровОстатки.КоличествоОстаток > 0
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПартииТоваровОстатки.Номенклатура,
						|	ПартииТоваровОстатки.Склад,
						|	ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка.Владелец КАК Поставщик,
						|	ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка КАК ТТпоставщика,
						|	СУММА(ПартииТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток
						|ПОМЕСТИТЬ ТоварныеОстаткиVMI
						|ИЗ
						|	РегистрНакопления.ПартииТоваров.Остатки(
						|			&ДтВрм,
						|			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						|				И Склад В
						|					(ВЫБРАТЬ
						|						Прайсы.Склад
						|					ИЗ
						|						Прайсы
						|					ГДЕ
						|						Прайсы.Склад.СкладVMI)
						|				И НЕ СтрокаПрихода = ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрокПриходов.ПустаяСсылка)
						|				И НЕ ЕСТЬNULL(СтрокаПрихода.ТорговаяТочка.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПартииТоваровОстатки
						|
						|СГРУППИРОВАТЬ ПО
						|	ПартииТоваровОстатки.Номенклатура,
						|	ПартииТоваровОстатки.Склад,
						|	ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка.Владелец,
						|	ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка
						|
						|ИМЕЮЩИЕ
						|	СУММА(ПартииТоваровОстатки.КоличествоОстаток) > 0
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	ПартииТоваровОстатки.Номенклатура,
						|	ПартииТоваровОстатки.Склад,
						|	ПартииТоваровОстатки.СтрокаПрихода.ТорговаяТочка.Владелец
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	РезервыТоваровОстатки.Номенклатура,
						|	РезервыТоваровОстатки.Склад,
						|	РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
						|ПОМЕСТИТЬ РезервыCвои
						|ИЗ
						|	РегистрНакопления.РезервыТоваров.Остатки(
						|			&ДтВрм,
						|			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						|				И Склад В
						|					(ВЫБРАТЬ
						|						Прайсы.Склад
						|					ИЗ
						|						Прайсы
						|					ГДЕ
						|						НЕ Прайсы.Склад.СкладVMI)) КАК РезервыТоваровОстатки
						|ГДЕ
						|	РезервыТоваровОстатки.КоличествоОстаток > 0
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	РезервыТоваровОстатки.Номенклатура,
						|	РезервыТоваровОстатки.Склад
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	РезервыТоваровОстатки.Номенклатура,
						|	РезервыТоваровОстатки.Склад,
						|	РезервыТоваровОстатки.СтрокаЗаявки.Поставщик КАК Поставщик,
						|	СУММА(РезервыТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток
						|ПОМЕСТИТЬ РезервыVMI
						|ИЗ
						|	РегистрНакопления.РезервыТоваров.Остатки(
						|			&ДтВрм,
						|			НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						|				И Склад В
						|					(ВЫБРАТЬ
						|						Прайсы.Склад
						|					ИЗ
						|						Прайсы
						|					ГДЕ
						|						Прайсы.Склад.СкладVMI)
						|				И НЕ СтрокаЗаявки = ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрокЗаявок.ПустаяСсылка)
						|				И НЕ ЕСТЬNULL(СтрокаЗаявки.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК РезервыТоваровОстатки
						|
						|СГРУППИРОВАТЬ ПО
						|	РезервыТоваровОстатки.Номенклатура,
						|	РезервыТоваровОстатки.Склад,
						|	РезервыТоваровОстатки.СтрокаЗаявки.Поставщик
						|
						|ИМЕЮЩИЕ
						|	СУММА(РезервыТоваровОстатки.КоличествоОстаток) > 0
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	РезервыТоваровОстатки.Номенклатура,
						|	РезервыТоваровОстатки.Склад,
						|	РезервыТоваровОстатки.СтрокаЗаявки.Поставщик
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ТоварныеОстаткиСвои.Номенклатура,
						|	ТоварныеОстаткиСвои.Склад,
						|	ТоварныеОстаткиСвои.КоличествоОстаток - ЕСТЬNULL(РезервыCвои.КоличествоОстаток, 0) КАК КоличествоОстаток
						|ПОМЕСТИТЬ СвойТовар
						|ИЗ
						|	ТоварныеОстаткиСвои КАК ТоварныеОстаткиСвои
						|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыCвои КАК РезервыCвои
						|		ПО ТоварныеОстаткиСвои.Склад = РезервыCвои.Склад
						|			И ТоварныеОстаткиСвои.Номенклатура = РезервыCвои.Номенклатура
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	ТоварныеОстаткиСвои.Номенклатура,
						|	ТоварныеОстаткиСвои.Склад
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СвободныйОстаток.Номенклатура,
						|	СвободныйОстаток.Склад,
						|	СвободныйОстаток.ТТпоставщика,
						|	СвободныйОстаток.Поставщик,
						|	СвободныйОстаток.КоличествоОстаток - ЕСТЬNULL(РезервыVMI.КоличествоОстаток, 0) КАК КоличествоОстаток
						|ПОМЕСТИТЬ ТоварVMI
						|ИЗ
						|	ТоварныеОстаткиVMI КАК СвободныйОстаток
						|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыVMI КАК РезервыVMI
						|		ПО СвободныйОстаток.Склад = РезервыVMI.Склад
						|			И СвободныйОстаток.Номенклатура = РезервыVMI.Номенклатура
						|			И СвободныйОстаток.Поставщик = РезервыVMI.Поставщик
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	СвободныйОстаток.Номенклатура,
						|	СвободныйОстаток.Склад,
						|	СвободныйОстаток.ТТпоставщика
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
						|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
						|ПОМЕСТИТЬ Цены
						|ИЗ
						|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
						|			&ДтВрм,
						|			Номенклатура В
						|					(ВЫБРАТЬ
						|						СвойТовар.Номенклатура
						|					ИЗ
						|						СвойТовар)
						|				И ТипЦен = &ТипЦенДляСайта) КАК ЦеныНоменклатурыСрезПоследних
						|ГДЕ
						|	ЦеныНоменклатурыСрезПоследних.Цена > 0
						|
						|СГРУППИРОВАТЬ ПО
						|	ЦеныНоменклатурыСрезПоследних.Номенклатура
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	ЦеныНоменклатурыСрезПоследних.Номенклатура
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура КАК Номенклатура,
						|	МАКСИМУМ(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена) КАК Цена,
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Владелец
						|ПОМЕСТИТЬ ЦеныКА
						|ИЗ
						|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
						|			&ДтВрм,
						|			Номенклатура.Номенклатура В
						|					(ВЫБРАТЬ
						|						ТоварVMI.Номенклатура
						|					ИЗ
						|						ТоварVMI)
						|				И  Номенклатура.Владелец В
						|					(ВЫБРАТЬ
						|						ТоварVMI.Поставщик
						|					ИЗ
						|						ТоварVMI)		
						|				И Номенклатура.Владелец В
						|					(ВЫБРАТЬ
						|						ВЫРАЗИТЬ(Прайсы.Владелец КАК Справочник.ТорговыеТочки).Владелец
						|					ИЗ
						|						Прайсы)) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
						|ГДЕ
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена > 0
						|
						|СГРУППИРОВАТЬ ПО
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура,
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Владелец
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СвойТовар.Номенклатура,
						|	СвойТовар.Склад,
						|	СвойТовар.КоличествоОстаток,
						|	ПрайсыПоставщиков1.ссылка КАК ПрайсПоставщика,
						|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена
						|ПОМЕСТИТЬ ВсеОстатки
						|ИЗ
						|	СвойТовар КАК СвойТовар
						|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
						|			Прайсы.Склад КАК Склад,
						|			МАКСИМУМ(Прайсы.Ссылка) КАК ссылка
						|		ИЗ
						|			Прайсы КАК Прайсы
						|		
						|		СГРУППИРОВАТЬ ПО
						|			Прайсы.Склад) КАК ПрайсыПоставщиков1
						|		ПО СвойТовар.Склад = ПрайсыПоставщиков1.Склад
						|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
						|		ПО СвойТовар.Номенклатура = Цены.Номенклатура
						|ГДЕ
						|	НЕ ПрайсыПоставщиков1.ссылка ЕСТЬ NULL
						|	И НЕ ПрайсыПоставщиков1.ссылка = ЗНАЧЕНИЕ(Справочник.ПрайсыПоставщиков.ПустаяСсылка)
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	ТоварVMI.Номенклатура,
						|	ТоварVMI.Склад,
						|	ТоварVMI.КоличествоОстаток,
						|	ПрайсыПоставщиков2.Ссылка,
						|	ЕСТЬNULL(ЦеныКА.Цена, 0)
						|ИЗ
						|	ТоварVMI КАК ТоварVMI
						|		ЛЕВОЕ СОЕДИНЕНИЕ Прайсы КАК ПрайсыПоставщиков2
						|		ПО ТоварVMI.Склад = ПрайсыПоставщиков2.Склад
						|			И ТоварVMI.ТТпоставщика = ПрайсыПоставщиков2.Владелец
						|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныКА КАК ЦеныКА
						|		ПО ТоварVMI.Номенклатура = ЦеныКА.Номенклатура
						|			И (ВЫРАЗИТЬ(ПрайсыПоставщиков2.Владелец КАК Справочник.ТорговыеТочки).Владелец = ЦеныКА.НоменклатураВладелец)
						|ГДЕ
						|	НЕ ПрайсыПоставщиков2.Ссылка ЕСТЬ NULL
						|	И НЕ ПрайсыПоставщиков2.Ссылка = ЗНАЧЕНИЕ(Справочник.ПрайсыПоставщиков.ПустаяСсылка)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВсеОстатки.ПрайсПоставщика,
						|	ВсеОстатки.Номенклатура,
						|	СУММА(ВсеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
						|	МАКСИМУМ(ВсеОстатки.Цена) КАК Цена
						|ПОМЕСТИТЬ ОстаткиСгруппированные
						|ИЗ
						|	ВсеОстатки КАК ВсеОстатки
						|
						|СГРУППИРОВАТЬ ПО
						|	ВсеОстатки.Номенклатура,
						|	ВсеОстатки.ПрайсПоставщика
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	ВсеОстатки.ПрайсПоставщика,
						|	ВсеОстатки.Номенклатура
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ЕСТЬNULL(ВсеОстатки.ПрайсПоставщика, Сайт.ПрайсПоставщика) КАК ПрайсПоставщика,
						|	ЕСТЬNULL(ВсеОстатки.Номенклатура, Сайт.Номенклатура) КАК Номенклатура,
						|	ЕСТЬNULL(ВсеОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокКоличество,
						|	ЕСТЬNULL(ВсеОстатки.Цена, 0) КАК Цена,
						|	1 КАК Сч
						|ИЗ
						|	ОстаткиСгруппированные КАК ВсеОстатки
						|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеСайта КАК Сайт
						|		ПО ВсеОстатки.ПрайсПоставщика = Сайт.ПрайсПоставщика
						|			И ВсеОстатки.Номенклатура = Сайт.Номенклатура
						|ГДЕ
						|	(НЕ ЕСТЬNULL(ВсеОстатки.КоличествоОстаток, 0) = ЕСТЬNULL(Сайт.СвободныйОстатокКоличество, 0)
						|			ИЛИ НЕ ЕСТЬNULL(ВсеОстатки.Цена, 0) = ЕСТЬNULL(Сайт.Цена, 0))
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	НаборЗаписейНаУдалениеВИсторииПосылок.ReceivedNo,
						|	НаборЗаписейНаУдалениеВИсторииПосылок.Номенклатура,
						|	НаборЗаписейНаУдалениеВИсторииПосылок.ПрайсПоставщика
						|ИЗ
						|	НаборЗаписейНаУдалениеВИсторииПосылок КАК НаборЗаписейНаУдалениеВИсторииПосылок";
	//Семенов И.П. 14.05.2019 XX-2457(
	КонецЕсли;
	//)Семенов И.П.
	
	Запрос.УстановитьПараметр("ДтВрм", ДтВрм);
	Запрос.УстановитьПараметр("ТипЦенДляСайта", Константы.ТипЦен_дляСайта.Получить());
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый); // read committed
	лРезультатыЗапросов = Запрос.ВыполнитьПакет();
	ЗафиксироватьТранзакцию();
	
	Возврат лРезультатыЗапросов;
КонецФункции
